broadcast_command = '/broadcast'
support_command = '/support'
broadcast_no_access = "К сожалению, у вас нет доступа к этой функции."
broadcast_wrong_format = f'Чтобы отправить сообщение всем вашим пользователям,' \
                         f' нажмите {broadcast_command} команда с текстом, разделенным пробелом.\n' \
                         f'Пример:\n' \
                         f'{broadcast_command} Привет, пользователи! Этот <b>выделенный жирным шрифтом</b> текст для вас,' \
                         f'а также этот <i>курсивный текст</i>.\n\n' \
                         f'Примеры использования стиля <code>HTML</code> вы можете найти <a href="https://core.telegram.org/bots/api#html-style">здесь</a>.'
confirm_broadcast = "Подтвердить ✅"
decline_broadcast = "Отмена ❌"
message_is_sent = "Сообщение отправлено ✅"
declined_message_broadcasting = "Рассылка сообщения отменена ❌"
error_with_html = "Не удается проанализировать ваш текст в стиле <code>HTML</code>. Причина: \n{reason}"

rating_place_top = "Привет! Привет! Поздравляю! Вы стали участником клуба лидеров Portobello и приглашены на закрытую вечеринку!\n\n" \
                "🏆 Мероприятие состоится 23 сентября! Информацию о времени и месте я пришлю вам в ближайшее время!\n\n" \
                "Думаю, вы и так все знаете о мероприятии. Нет? 😎 Читайте тут подробнее 👉 https://portobello.ru/news/zakrytaya_vstrecha_kluba_liderov_portobello//. Ждем вас!\n\n" \
                "☝️ Обратите внимание: мероприятие проходит офлайн в Москве. " \
                "🔥Регионам мы компенсируем 50% стоимости авиабилета! " \
                "Для компенсации билета обратитесь к своему менеджеру Portobello,  и он скажет,  что вам необходимо предоставить.\n\n" \
                "💎Теперь вам доступен закрытый канал для лучших менеджеров 😉 https://t.me/+sOQgGJ7yMv9mZGNi"

rating_place_middle = "Ваше место в рейтинге {rating_place}\n" \
                "Топ 100 сформирован по итогам 31 августа. К сожалению, вы не попадаете на закрытую вечеринку Клуба Лидеров Portobello, которая пройдёт 23 сентября в арт-галерее «Красные Холмы»\n\n" \
                "У вас есть все шансы присоединиться к нам в СОЧИ 😎🌴 Запускайте заказы, следи за рейтингом, обгоняйте конкурентов – и мы обязательно увидимся! Желаю удачи! ✌️\n\n" \
                "Подробности о СОЧИ вместе с Portobello – https://portobello.ru/news/v_sochi_s_portobello!/\n\n" \
                "*Запуски заказов продолжают учитываться для акции «СОЧИ». На следующей неделе вы сможете продолжить следить за местом в рейтинге!\n\n" \

rating_place_outside = "В настоящий момент у вас нет запущенных заказов и позиции в рейтинге.\n\n" \
                    "Кто запустит в работу заказы с 06.04.2022 по 31.12.2022 г.  на общую сумму 3 000 000 рублей и более, получит шанс на тотальную перезагрузку с Portobello Team в Сочи весной 2023 года! 🌴\n\n" \
                    "—\n" \
                    "Вот было бы здорово махнуть на море! 🙄\n\n" \
                    "С теми, с кем есть о чём поговорить 💬\n\n"\
                    "С теми, кто может научить без скучных лекций, вдохновить без привычных лозунгов и сделать успешнее без покупки бесполезных курсов 🧠\n\n" \
                    "И чтобы море ⛱, горы ⛰, чайки 🕊, пальмы 🌴, чурчхела-кукуруза-пахлава 🌽 и вот это вот всё! 🥳\n\n" \
                    "Да ❓\n" \
                    "Да ❓\n" \
                    "Да ❗️\n" \
                    "👉 Хватит мечтать! Поехали с нами!\n\n" \
                    "Весной 2023 года Portobello Team ждёт самых ярких, успешных и активных менеджеров в Сочи! 🌞"
